[
    {
        "title": "Angular vs React vs Vue?", "description":"This post is a comprehensive guide on which is perhaps the right solution for you: Angular vs React vs Vue.Just a couple of years ago, developers were mainly debating whether they should be using Angular vs React for their projects. But over the course of the last couple of years, we’ve seen a growth of interest in a third player called Vue.js.", "img": "https://iotvnaw69daj.i.optimole.com/cb:n2y9~6666f/w:1450/h:740/q:mauto/f:avif/https://www.codeinwp.com/wp-content/uploads/2019/01/angular-vs-vue-vs-react.jpg", "author":"Morshed"
    },
    {
        "title": "The Four Kinds of React State to Manage?", "description":"When we talk about state in our applications, its important to be clear about what types of state actually matter. There are four main types of state you need to properly manage in your React apps: Local state Global state Server state URL state Local (UI) state – Local state is data we manage in one or another component. Global (UI) state – Global state is data we manage across multiple componentsServer state – Data that comes from an external server that must be integrated with our UI state", "img": "https://www.freecodecamp.org/news/content/images/size/w2000/2022/02/how-to-manage-state-react.png", "author":"Morshed"
    },
    {
        "title": " What is a unit test? Why should we write unit tests?", "description":"Unit testing is a software development process in which the smallest testable parts of an application, called units, are individually and independently scrutinized for proper operation. This testing methodology is done during the development process by the software developers and sometimes QA staff.  The main objective of unit testing is to isolate written code to test and determine if it works as intended. Unit testing is an important step in the development process, because if done correctly, it can help detect early flaws in code which may be more difficult to find in later testing stages. Unit testing is a component of test-driven development (TDD), a pragmatic methodology that takes a meticulous approach to building a product by means of continual testing and revision. This testing method is also the first level of software testing, which is performed before other testing methods such as integration testing. Unit tests are typically isolated to ensure a unit does not rely on any external code or functions. Testing can be done manually but is often automated. ", "img": "https://www.softwaretestinghelp.com/wp-content/qa/uploads/2012/11/Unit-Testing.png", "author":"Morshed"
    },
    {
        "title": "How does prototypical inheritance work?", "description":"Every object with its methods and properties contains an internal and hidden property known as [[Prototype]]. The Prototypal Inheritance is a feature in javascript used to add methods and properties in objects. It is a method by which an object can inherit the properties and methods of another object. Traditionally, in order to get and set the [[Prototype]] of an object, we use Object.getPrototypeOf and Object.setPrototypeOf. Nowadays, in modern language, it is being set using __proto__.", "img": "https://dmitripavlutin.com/javascript-prototypal-inheritance/cover.png", "author":"Morshed"
    }
]